#include <stdio.h>

/**
 *  printf("%d\n", 10 / 3);     //3
    printf("%d\n", 10 / 3 * 3); //9  两个整数的运算结果只能是整数
   
    printf("%f\n", 10.0 / 3);     //3.333333
    printf("%f\n", 10.0 / 3 * 3); //10.000000
    * 10和10.0在C中是完全不同的数
    * 10.0 是浮点数
    * 运算中有浮点数会把整数转换成浮点数，然后进行浮点数运算。（因为浮点数能表达的数更多，范围更大）
 * */
int main(int argc, const char *argv[])
{
    // printf("请分别输入身高的英尺和英寸，"
    //        "如输入\"5 7\"表示5英尺和7英寸：");
    // int a;
    // int b;
    // scanf("%d %d", &a, &b); //scanf参数仅能是format 不能有其他字符串
    // printf("换算为米是：%f\n", ((a + b / 12.0) * 0.3048));

    /**
     * 或把 a b换成浮点数 
     **/
    printf("请分别输入身高的英尺和英寸，"
           "如输入\"5 7\"表示5英尺和7英寸：");
    float a;
    float b;
    scanf("%f %f", &a, &b); //scanf参数仅能是format 不能有其他字符串
    printf("换算为米是：%f\n", ((a + b / 12) * 0.3048));
}