#include <stdio.h>

int main()
{
    // int i, j;
    // j = i + 10;
    // printf("%d\n", i + j);

    printf("%d\n", 10 / 3);     //3
    printf("%d\n", 10 / 3 * 3); //9  两个整数的运算结果只能是整数

    printf("%f\n", 10 / 3);     //0.000000
    printf("%f\n", 10 / 3 * 3); //0.000000

    printf("%f\n", 10.0 / 3);     //3.333333
    printf("%f\n", 10.0 / 3 * 3); //10.000000
    /**
     * 10和10.0在C中是完全不同的数
     * 10.0 是浮点数
     * 
     * 运算中有浮点数会把整数转换成浮点数，然后进行浮点数运算。（因为浮点数能表达的数更多，范围更大）
     **/

    return 0;
}